heshanpasindusankalpa/Portable-STM32-Based-Real-Time-Motion-Path-Visualization-System2/Core/Src/010i2c_master_tx_testing.c
/*
 * 010i2c_master_tx_testing.c
 *
 *  Created on: Apr 9, 2026
 *      Author: ASUS
 */
#include<stdio.h>
#include<string.h>
#include"stm32f407xx.h"
#include "stm32f407xx_gpio.h"
#include "stm32f407xx_i2c_drivers.h"

#define MY_ADDR 0x61
#define SLAVE_ADDR 0x68

void delay(void)
{
    for(uint32_t i = 0; i < 500000/2; i++);
}

I2C_Handle_t I2C1Handle;
uint8_t some_data[] = "We are testing I2C mastetr Tx\n";

void I2C1_GPIOInit(void)
{
    GPIO_Handle_t I2CPins;
    I2CPins.pGPIOx = GPIOB;
    I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
    I2CPins.GPIO_PinConfig.GPIO_PinPulPdControl = GPIO_PU;
    I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
    I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

    //scl
    I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
    GPIO_Init(&I2CPins);

    //sda
    I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
    GPIO_Init(&I2CPins);
}

void I2C1_Inits(void)
{
    I2C1Handle.pI2Cx = I2C1;
    I2C1Handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
    I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
    I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
    I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

    I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
    GPIO_Handle_t GPIOBtn, GpioLed;

    //btn gpio configuration
    GPIOBtn.pGPIOx = GPIOB;
    GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
    GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOBtn.GPIO_PinConfig.GPIO_PinPulPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOBtn);

    //led gpio configuration
    GpioLed.pGPIOx = GPIOD;
    GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
    GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
    GpioLed.GPIO_PinConfig.GPIO_PinPulPdControl = GPIO_NO_PUPD;

    GPIO_PeriClockControl(GPIOD, ENABLE);
    GPIO_PeriClockControl(GPIOB, ENABLE);

    GPIO_Init(&GpioLed);
}

int main(void)
{
    GPIO_ButtonInit();

    //ENABLE I2C CLOCK
    I2C_PeriClockControl(I2C1, ENABLE);

    //i2c pin inits
    I2C1_GPIOInit();

    //i2c peripheral configuration
    I2C1_Inits();

    //enable the i2c peripheral
    I2C_PeripheralControl(I2C1, ENABLE);

    while(1)
    {
        //wait till button is pressed
        while(!GPIO_ReadFromInputPin(GPIOB, GPIO_PIN_NO_14));

        //to avoid button de-bouncing related issues 200ms of delay
        delay();

        //send some data to the slave
        I2C_MasterSendData(&I2C1Handle, some_data, strlen((char*)some_data), SLAVE_ADDR);
    }
}
